app/controllers/aiit_members_controller.rb

SELECT "aiit_members".* FROM "aiit_members"
---
  def index
    @aiit_members = AiitMember.all

SELECT "aiit_members".* FROM "aiit_members" WHERE "aiit_members"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @aiit_member = AiitMember.find(params[:id])

SELECT "aiit_members".* FROM "aiit_members" WHERE "aiit_members"."id" = ? LIMIT 1  [["id", "1"]]
---
  def edit
    @aiit_member = AiitMember.find(params[:id])

INSERT INTO "aiit_members" ("birthday", "created_at", "gender", "kana_name", "memo", "name", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @aiit_member = AiitMember.new(params[:aiit_member])

    respond_to do |format|
      if @aiit_member.save

SELECT "aiit_members".* FROM "aiit_members" WHERE "aiit_members"."id" = ? LIMIT 1  [["id", "1"]]
---
  def update
    @aiit_member = AiitMember.find(params[:id])

SELECT "aiit_members".* FROM "aiit_members" WHERE "aiit_members"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "aiit_members" WHERE "aiit_members"."id" = 1
---
  def destroy
    @aiit_member = AiitMember.find(params[:id])
    @aiit_member.destroy