app/controllers/exam_lists_controller.rb

  def index
    @exam_lists = ExamList.all
---
SELECT "exam_lists".* FROM "exam_lists"

  def show
    @exam_list = ExamList.find(params[:id])
---
SELECT "exam_lists".* FROM "exam_lists" WHERE "exam_lists"."id" = ? LIMIT 1  [["id", "1"]]

  def edit
    @exam_list = ExamList.find(params[:id])
---
SELECT "exam_lists".* FROM "exam_lists" WHERE "exam_lists"."id" = ? LIMIT 1  [["id", "1"]]

  def create
    @exam_list = ExamList.new(params[:exam_list])

    respond_to do |format|
      if @exam_list.save
---
INSERT INTO "exam_lists" ("aiit_member_id", "basic_knowledge", "citizen_of_tokyo", "created_at", "decision_reason", "exam_no", "exam_year", "examination", "interview", "memo", "paper", "presentation", "result", "review_flg", "test_score", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    @exam_list = ExamList.find(params[:id])
---
SELECT "exam_lists".* FROM "exam_lists" WHERE "exam_lists"."id" = ? LIMIT 1  [["id", "1"]]

  def destroy
    @exam_list = ExamList.find(params[:id])
    @exam_list.destroy
---
SELECT "exam_lists".* FROM "exam_lists" WHERE "exam_lists"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "exam_lists" WHERE "exam_lists"."id" = 1