app/controllers/guarantors_controller.rb

  def index
    @guarantors = Guarantor.all
---
SELECT "guarantors".* FROM "guarantors"

  def show
    @guarantor = Guarantor.find(params[:id])
---
SELECT "guarantors".* FROM "guarantors" WHERE "guarantors"."id" = ? LIMIT 1  [["id", "1"]]

  def edit
    @guarantor = Guarantor.find(params[:id])
---
SELECT "guarantors".* FROM "guarantors" WHERE "guarantors"."id" = ? LIMIT 1  [["id", "1"]]

  def create
    @guarantor = Guarantor.new(params[:guarantor])

    respond_to do |format|
      if @guarantor.save
---
INSERT INTO "guarantors" ("created_at", "guarantor_address", "guarantor_kana", "guarantor_tel", "guarantor_zip", "memo", "name", "relationship", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    @guarantor = Guarantor.find(params[:id])
---
SELECT "guarantors".* FROM "guarantors" WHERE "guarantors"."id" = ? LIMIT 1  [["id", "1"]]

  def destroy
    @guarantor = Guarantor.find(params[:id])
    @guarantor.destroy
---
SELECT "guarantors".* FROM "guarantors" WHERE "guarantors"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "guarantors" WHERE "guarantors"."id" = 1