app/controllers/privacies_controller.rb

  def index
    @privacies = Privacy.all
---
SELECT "privacies".* FROM "privacies"

  def show
    @privacy = Privacy.find(params[:id])
---
SELECT "privacies".* FROM "privacies" WHERE "privacies"."id" = ? LIMIT 1  [["id", "1"]]

  def edit
    @privacy = Privacy.find(params[:id])
---
SELECT "privacies".* FROM "privacies" WHERE "privacies"."id" = ? LIMIT 1  [["id", "1"]]

  def create
    @privacy = Privacy.new(params[:privacy])

    respond_to do |format|
      if @privacy.save
---
INSERT INTO "privacies" ("address", "aiit_member_id", "birthplace", "block", "building", "city", "company", "company_address", "created_at", "department", "eng_name", "graduated_date", "graduated_school", "memo", "mobile", "mobile_email", "new_graduates", "occupation", "pc_email", "stream", "tel", "updated_at", "work_period", "zip_code") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    @privacy = Privacy.find(params[:id])
---
SELECT "privacies".* FROM "privacies" WHERE "privacies"."id" = ? LIMIT 1  [["id", "1"]]

  def destroy
    @privacy = Privacy.find(params[:id])
    @privacy.destroy
---
SELECT "privacies".* FROM "privacies" WHERE "privacies"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "privacies" WHERE "privacies"."id" = 1