app/controllers/prospects_controller.rb

SELECT "prospects".* FROM "prospects"
---
  def index
    @prospects = Prospect.all

SELECT "prospects".* FROM "prospects" WHERE "prospects"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @prospect = Prospect.find(params[:id])

SELECT "prospects".* FROM "prospects" WHERE "prospects"."id" = ? LIMIT 1  [["id", "1"]]
---
  def edit
    @prospect = Prospect.find(params[:id])

INSERT INTO "prospects" ("aiit_member_id", "applikation", "contact_unnecessary", "created_at", "event", "memo", "received_date", "updated_at", "visited_date", "wished_material", "wished_program") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @prospect = Prospect.new(params[:prospect])

    respond_to do |format|
      if @prospect.save

SELECT "prospects".* FROM "prospects" WHERE "prospects"."id" = ? LIMIT 1  [["id", "1"]]
---
  def update
    @prospect = Prospect.find(params[:id])

SELECT "prospects".* FROM "prospects" WHERE "prospects"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "prospects" WHERE "prospects"."id" = 1
---
  def destroy
    @prospect = Prospect.find(params[:id])
    @prospect.destroy