app/controllers/status_records_controller.rb

  def index
    @status_records = StatusRecord.all
---
SELECT "status_records".* FROM "status_records"

  def show
    @status_record = StatusRecord.find(params[:id])
---
SELECT "status_records".* FROM "status_records" WHERE "status_records"."id" = ? LIMIT 1  [["id", "1"]]

  def edit
    @status_record = StatusRecord.find(params[:id])
---
SELECT "status_records".* FROM "status_records" WHERE "status_records"."id" = ? LIMIT 1  [["id", "1"]]

  def create
    @status_record = StatusRecord.new(params[:status_record])

    respond_to do |format|
      if @status_record.save
---
INSERT INTO "status_records" ("absence_reason", "absence_time", "beginning", "created_at", "end", "memo", "return_reason", "status", "student_list_id", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    @status_record = StatusRecord.find(params[:id])
---
SELECT "status_records".* FROM "status_records" WHERE "status_records"."id" = ? LIMIT 1  [["id", "1"]]

  def destroy
    @status_record = StatusRecord.find(params[:id])
    @status_record.destroy
---
SELECT "status_records".* FROM "status_records" WHERE "status_records"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "status_records" WHERE "status_records"."id" = 1