app/controllers/student_lists_controller.rb

  def index
    @student_lists = StudentList.all
---
SELECT "student_lists".* FROM "student_lists"

  def show
    @student_list = StudentList.find(params[:id])
---
SELECT "student_lists".* FROM "student_lists" WHERE "student_lists"."id" = ? LIMIT 1  [["id", "1"]]

  def edit
    @student_list = StudentList.find(params[:id])
---
SELECT "student_lists".* FROM "student_lists" WHERE "student_lists"."id" = ? LIMIT 1  [["id", "1"]]

  def create
    @student_list = StudentList.new(params[:student_list])

    respond_to do |format|
      if @student_list.save
---
INSERT INTO "student_lists" ("PBL_1st", "PBL_2nd", "PBL_teacher", "aiit_member_id", "campus_email", "classification", "created_at", "entrance_date", "grade", "graduation_date", "guarantor_id", "memo", "name", "nationality", "program", "student_account", "study_period", "updated_at", "visa") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    @student_list = StudentList.find(params[:id])

    respond_to do |format|
      if @student_list.update_attributes(params[:student_list])
---
SELECT "student_lists".* FROM "student_lists" WHERE "student_lists"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "student_lists" SET "classification" = '科目等履修生', "beginning" = '2013-11-06', "end" = '2013-11-06', "updated_at" = '2013-11-06 08:21:47.841566' WHERE "student_lists"."id" = 1

  def destroy
    @student_list = StudentList.find(params[:id])
    @student_list.destroy
---
SELECT "student_lists".* FROM "student_lists" WHERE "student_lists"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "student_lists" WHERE "student_lists"."id" = 1