app/controllers/tuitions_controller.rb

  def index
    @tuitions = Tuition.all
---
SELECT "tuitions".* FROM "tuitions"

  def show
    @tuition = Tuition.find(params[:id])
---
SELECT "tuitions".* FROM "tuitions" WHERE "tuitions"."id" = ? LIMIT 1  [["id", "1"]]

  def edit
    @tuition = Tuition.find(params[:id])
---
SELECT "tuitions".* FROM "tuitions" WHERE "tuitions"."id" = ? LIMIT 1  [["id", "1"]]

  def create
    @tuition = Tuition.new(params[:tuition])

    respond_to do |format|
      if @tuition.save
---
INSERT INTO "tuitions" ("created_at", "exemption_type", "loan_amount", "memo", "scholarship_division", "student_list_id", "transfer_request", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

  def update
    @tuition = Tuition.find(params[:id])
---
SELECT "tuitions".* FROM "tuitions" WHERE "tuitions"."id" = ? LIMIT 1  [["id", "1"]]

  def destroy
    @tuition = Tuition.find(params[:id])
    @tuition.destroy
---
SELECT "tuitions".* FROM "tuitions" WHERE "tuitions"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "tuitions" WHERE "tuitions"."id" = 1